var products = {
  'sfp-solvet': {
    'name': 'ШФП Сольвет',
    'materials': [
      {
        'name': 'Баннер литой 510г.',
        'widths': [
          '137',
          '250',
          '320'
        ]
      },
      {
        'name': 'Баннер литой 460г.',
        'widths': [
          '320'
        ]
      },
      {
        'name': 'Баннер ламинированный 440г.',
        'widths': [
          '137',
          '250',
          '320'
        ]
      },
      {
        'name': 'Баннер ламинированный  340г.',
        'widths': [
          '137',
          '250',
          '320'
        ]
      },
      {
        'name': 'Баннер ламинированный  300г.',
        'widths': [
          '320'
        ]
      },
      {
        'name': 'Баннер транслюсцентный 600г.',
        'widths': [
          '137',
          '250',
          '320'
        ]
      },
      {
        'name': 'Баннерная сетка 370г.',
        'widths': [
          '160',
          '320'
        ]
      },
      {
        'name': 'Самоклеящаяся пленка матовая/глянцевая 140г/м^2, 85мкр.',
        'widths': [
          '137',
          '152'
        ]
      },
      {
        'name': 'Самоклеящаяся пленка транслюсцентная 120г/м^2, 80мкр.',
        'widths': [
          '137'
        ]
      },
      {
        'name': 'Самоклеящаяся пленка перфорированная для оконной графики',
        'widths': [
          '137',
          '152'
        ]
      },
      {
        'name': 'Синтетический холст 160 г/м^2',
        'widths': [
          '152',
          '180'
        ]
      }
    ],
    'cost': 'formula',
    'extra': 'formula',
    'options': {
      'prokleika': {
        'values': [
          'не требуется',
          'по периметру',
          'верх',
          'низ',
          'лево',
          'право',
          'верх-низ',
          'лево-право'
        ]
      },
      'skleika': {
        'values': [
          'не требуется',
          'по горизонтали',
          'по вертикали'
        ]
      },
      'rezka': {
        'values': [
          'не требуется',
          'по периметру',
          'верх',
          'низ',
          'лево',
          'право',
          'верх-низ',
          'лево-право'
        ]
      },
      'klapani': {
        'values': [
          'не требуется',
          '3 на на м²',
          '4 на на м²',
        ]
      },
      'luversi': {
        'values': [
          'не требуется',
          'по периметру',
          'верх',
          'низ',
          'лево',
          'право',
          'верх-низ',
          'лево-право',
          'по углам',
        ],
        'space': {
          'values': [
            10,
            20,
            30,
            40,
            50,
            100
          ]
        }
      },
      'fields': {
        'label': 'Поля',
        'values': [
          0,1,3,5,10,15,20
        ]
      },
    }
  },
  /* 'sfp-solvet-eco': {
    'materials': [
    
    ],
    'cost': 'formula',
    'extra': 'formula'
  }, */
  'stickers': {
    'name': 'Наклейки с фигурной резкой',
    'materials': [
      {
        'name': 'Самоклеящаяся пленка (глянцевая/матовая/прозрачная) 140г/м^2, 85мкр',
        'widths': [
          '137',
          '152'
        ],
        'cost': 0.06
      }, {
        'name': 'Самоклеящаяся пленка металик  (серебро/золото) 140г/м^2, 85мкр',
        'widths': [
          '137'
        ],
        'cost': 0.08
      }
    ],
    'options': {
      'fields': {
        'label': 'Поля',
        'values': [
          0,
          1,
          3,
          5,
          10,
          15,
          20
        ]
      },
      'lamination': {
        'label': 'Ламинация',
        'values': [
          'не требуется',
          'требуется'
        ],
        'pricing': 'square',
        'cost': [
          0,
          0.03
        ]
      }
    }
  }
};